#### Terraform Plan
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.ct_config.ignition will be read during apply
  # (config refers to values not yet known)
 <= data "ct_config" "ignition" {
      + content      = (known after apply)
      + files_dir    = "./.."
      + id           = (known after apply)
      + pretty_print = false
      + rendered     = (known after apply)
      + strict       = true
    }

  # null_resource.regenerate_key must be replaced
-/+ resource "null_resource" "regenerate_key" {
      ~ id       = "3335283344564992552" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "bootstrap_config_hash" = "b54db110b9e7c740cdaced1b91f430b6339f6f341895bacd71cc2b94ce566b80" -> "0e5f4237155d4efb6d0133283521bdca6a09c4d46ca6f71c96638c92304fca90"
            # (11 unchanged elements hidden)
        }
    }

  # oci_core_instance.this must be replaced
-/+ resource "oci_core_instance" "this" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.uk-london-1.abwgiljtjfgbgxmhkskukaplbunbolt3snwuafbqlkj6z3slmhrptzz43fza" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "default/terraform" -> null
          - "Oracle-Tags.CreatedOn" = "2026-02-12T18:55:58.632Z" -> null
            # (3 unchanged elements hidden)
        }
      ~ extended_metadata                   = {} -> (known after apply)
      ~ fault_domain                        = "FAULT-DOMAIN-3" -> (known after apply)
      ~ freeform_tags                       = {} -> (known after apply)
      + hostname_label                      = (known after apply)
      ~ id                                  = "ocid1.instance.oc1.uk-london-1.anwgiljtwlhza7ach2vjzm336amtmuq5gyopjimti5gi5k45th3igidid3dq" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.uk-london-1.aaaaaaaaze7uoavoo7lblhkq4rzfclpwrrfoubqvqiprstvqtpvi4j4ymfka" -> (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_ai_enterprise_enabled            = (known after apply)
      ~ is_cross_numa_node                  = false -> (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = {
          - "user_data" = "eyJpZ25pdGlvbiI6eyJjb25maWciOnsicmVwbGFjZSI6eyJ2ZXJpZmljYXRpb24iOnt9fX0sInByb3h5Ijp7fSwic2VjdXJpdHkiOnsidGxzIjp7fX0sInRpbWVvdXRzIjp7fSwidmVyc2lvbiI6IjMuNC4wIn0sImtlcm5lbEFyZ3VtZW50cyI6e30sInBhc3N3ZCI6e30sInN0b3JhZ2UiOnsiZGlyZWN0b3JpZXMiOlt7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvZGF0YSIsInVzZXIiOnt9LCJtb2RlIjo0OTN9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9yZXBvIiwidXNlciI6e30sIm1vZGUiOjQ5M30seyJncm91cCI6e30sInBhdGgiOiIvb3B0L2VudiIsInVzZXIiOnt9LCJtb2RlIjo0OTN9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9zY3JpcHRzIiwidXNlciI6e30sIm1vZGUiOjQ5M30seyJncm91cCI6e30sInBhdGgiOiIvZXRjL29jaS12YXVsdCIsInVzZXIiOnt9LCJtb2RlIjo0NDh9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL2V0Yy9yY2xvbmUiLCJ1c2VyIjp7fSwibW9kZSI6NDQ4fSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9ldGMvYnVja2V0IiwidXNlciI6e30sIm1vZGUiOjQ0OH0seyJncm91cCI6e30sInBhdGgiOiIvb3B0L3NlY3JldHMiLCJ1c2VyIjp7fSwibW9kZSI6NDQ4fV0sImZpbGVzIjpbeyJncm91cCI6e30sInBhdGgiOiIvZXRjL3RtcGZpbGVzLmQvb2NpLWFwcHMuY29uZiIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6IiIsInNvdXJjZSI6ImRhdGE6LGQlMjAlMkZydW4lMkZzZWNyZXRzJTIwMDcwMCUyMHJvb3QlMjByb290JTIwLSUwQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0MjB9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL2V0Yy9sb2NhbGUuY29uZiIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6IiIsInNvdXJjZSI6ImRhdGE6LExBTkclM0RDLlVURi04JTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQyMH0seyJncm91cCI6e30sInBhdGgiOiIvZXRjL3ppbmNhdGkvY29uZmlnLmQvNTUtdXBkYXRlLXN0cmF0ZWd5LnRvbWwiLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiJnemlwIiwic291cmNlIjoiZGF0YTo7YmFzZTY0LEg0c0lBQUFBQUFBQy96VE5NYXJETUF5QTRWMm5FSm9md2E5MEttVHQxcW1GRHNFRVU0dEUwTmpCbGdtNWZWRWcwNGVFMEQrME5RYmw2cUZxQ2NyVGpqM1N5a1Z5bEE4QkRPZEZkeTY3VFZMTW0vY1F3MTZ4eHdIcGtSUDlJYjBhRzIrT3h6UTM0MTdFZUFZOWFJblFhcUhvcUxLdzlkejE1aHpCbDlPazg3aElhc3IyK2YvaTRCY0FBUC8vK3EyZGdLSUFBQUE9IiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQyMH0seyJncm91cCI6e30sInBhdGgiOiIvZXRjL29jaS12YXVsdC9jb25maWciLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiJnemlwIiwic291cmNlIjoiZGF0YTo7YmFzZTY0LEg0c0lBQUFBQUFBQy81elB1MjZzTUJnRTRIN2ZaWkU0M0twVHJBZ0YwaXFKZ0NRbCtySHh3bUw4WStNYmZ2b29TUm1sMmFsRzAzeWE5OHZidGV2YnFteXFycStmK3ZKYVY4OWY3VCtTbWNhUkJjUDFQaEkxNmdoSkhKbmx6RkZRRk9jNGdoVys0L2dVb0FEQWtKR0pTajU2QThlTkhFc1dEcHF6d1NTVTBYM0xCUitVZFdZdVZBYW5QK0NmNFFFOEd6Vkx1VmJyUGR6OU1CTVo3Q3dLU0taMTA0ai9UTTZVbCtZbUNyZktYM2hUdFYxZDlxK1h0djE0YVI3NW5uTG5XSUZxMklHZ3RYNHhkdGlOVEFSSk4zQmV6Y0VqT2NMQ2ZDNVBud0VBQVAvLzd0emU1SFVCQUFBPSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjozODR9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL2V0Yy9yY2xvbmUvcmNsb25lLmNvbmYiLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiIiLCJzb3VyY2UiOiJkYXRhOiwlNUJvY2ktYmFja3VwJTVEJTBBdHlwZSUyMCUzRCUyMG9yYWNsZW9iamVjdHN0b3JhZ2UlMEFwcm92aWRlciUyMCUzRCUyMGluc3RhbmNlX3ByaW5jaXBhbF9hdXRoJTBBbmFtZXNwYWNlJTIwJTNEJTIwbHJreTBmMW5tb3RzJTBBcmVnaW9uJTIwJTNEJTIwdWstbG9uZG9uLTElMEFub19jaGVja19idWNrZXQlMjAlM0QlMjB0cnVlJTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjM4NH0seyJncm91cCI6e30sInBhdGgiOiIvZXRjL2J1Y2tldC9jb25maWciLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiIiLCJzb3VyY2UiOiJkYXRhOixCVUNLRVRfTkFNRSUzRG9jaS1hcHBzJTBBT0NJX05BTUVTUEFDRSUzRGxya3kwZjFubW90cyUwQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjozODR9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9zY3JpcHRzL2ZpcnN0LWJvb3Quc2giLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiJnemlwIiwic291cmNlIjoiZGF0YTo7YmFzZTY0LEg0c0lBQUFBQUFBQy8zeVJ3V29iUVF5Rzcvc1VxdHRUWVhZUEtRMFVTZy91eFJBSU5MMkZZTWF6MnQwaE15TlYwcnB4eU1PWDNjUjJXRXh2Zy9UUEovSHA0NGRtRjB1ejh6cFVpZ1lPUndLT2pKMlBxYW93REFTcm4vUzNKUEp0TEQzODlqRnA4QW5ydWw1VllaUUVydE83R3hqTVdMODFEVC8yV3RzcEZTZzNhbjZYc0RrVnQ4a2JxbTI5NUs5ZmF1dWZ3UkUwbHZrY21hcVZlUUgzOU54ZDZJRmJ6OVVxOEtLNy9YeCsvNmZWUWpPcU5JbUNUN09DU2pJNHVUaHJTWG5UY2xJQnNhajVORUdObHR6VjBlTG1OVFJKNUlNTlZLNGNSNTQxQ21kSGFvSW5GRGpubWRQQnBiakg5L2tMdE52MUJ0WTNHL0NsQmFZMisrSUNaU1o5dlJGSHZucUhaY0V1UG4wL2J3a1VvZ3NwTHY0ZUI2MEhESS9UbUk0RWJ1OWc1SGE2M25MdmtYdnhMY0xMQzl6Znc2Y2Y0UEFQWEYvRHc4TVI5QXN6N1NjUU1SYlZ3U25LSG1VSm9qMkt4QlpCcGp3dTBtZllqc2dtbWhITXBpQU12dlJ2aStsQkRYT3dCRElIcTM4QkFBRC8veENjMzV2b0FnQUEiLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6NDkzfSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvc2NyaXB0cy9mZXRjaC1jb25maWcuc2giLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiJnemlwIiwic291cmNlIjoiZGF0YTo7YmFzZTY0LEg0c0lBQUFBQUFBQy80UlUzMi9iTmhCKzUxOXg0L1FRTDVPVlpHL3R0TUZOTXF4WTBnWnVBbXpZQm9PbVR0Yk5GTW1TcDZWWjBmOTkwQzliTGh6a1NicnZ2dnQ0eHp2ZXQ5OWthN0xaV3NWS1JHUklzWEhneVdPcHlBaHh1L2g5dGJpL3Y3Njl1LytRWDV5SnErdWJ4Ui81RDJmaXpjUGxiOWYzcTNlTDIrdGNKdWR5Q255NFcxeTI2SVVVYmVUcTZ1MHlseG5YUG5PYVV1MXNTWnUwY0kvV09GVklzYnkrZTc5NldON2tzbUwyOFZXV2JZaXJaajNYcnM3V2lzbVNWdjkxc2NyN09OOFFEMEc5c1BPY0JmUnV4eGk4YjVhTGQ1ZS81ckpXWktVUTQ0R3JSK0pxRlpBRFlUeVp3V2NCWUp4V0JuekFrajdseWZrT0tUQnlubHpzYk1XTXRlZjhYQWlBZWx0UWdOU0RURnFlRkFDaGhqU1VJSk94Ym5uSTI4TUM0TEVpZzNCeU1xckNqemxNN3h0bXM5ZFFPQUVBZ0xweUlCY0RNUmtpc21US2Z3VlhRNGxrTjVEMDFRQTdHTkxyaE5vZW4yTDM2elNCaStEVy82Qm1XRGRtdTJzSy9OVXhBTkpVTlZ3QjJjakthbHo1UUZhVFYyYkNzS3JHNkpWR2tNblhVeUFudkhXanQ4Z2QvWkE1SlExWnl5SDlxV3RNTG0ydmMzS1hFNHI3RjhOaklPNEw3SHNXV1hFVDgrVG5YZjBwOW5kQkpmd0pTZStIRkQvQ0dmejlHcmhDT3doMmhMU1lISmJ0OGpwa0FtZ1BhVGpHL0c2WWowd08zSktHbjZQVDBqbVFtMkRoVEF6ME1kdkpyUHgwWkZZbStmVHo4b3NpZ3dXb2tqSEF3YXlNT25FOEVqOFJ3L25CZ2IzR09GTlFkbUxmdDhtRnAzYkN5RUx5dVZzSVgrSjhQdStWb2tIMGtIUndCK3h6UGoyRjJVd0FGTTZpK0NMRWtDT3lybHE1Zmk4MFFURTVDMlZ3TmJ5L2ZBdjkxSFQ2eDU4d3lENHkrOWlvd2lESFRJTE1rSFdtbldWRkZrUE00bE5rckF2NWdzUkEyeW1NZHY5OUtacHNTWkcwTXNPTzYyU0NjNXpOdjJhOEpNVkJZVW5iWjRVRy8wc3lxbUVYTURMcFo1WDJGRG0yNU5JNDIzWkVlVzlJOS8xb0Yyd2tkdUdwYThWa3A1MFVGSVkzUFM1bE9aTmlRd3phT0l2dHkwWFBGWnkzT3lBb3E2dVIybTlvT1pvUHl4czVWUkhHUWhvbnlLU2pFcnE5dndlRWFLdHdBYld6a0M3aG1RazR4anJzc2hEOVY3T0JRbUh0YkJxd3ZlS3BBNjFhbTdZMDZ4NjcvVk1HakZXSWNlNFZWeDNpamJKYnRiY3RNV1BZMndFTFErdTlyYnhQMTBwdkd6OW5xakhzUUI4YWl4TnNRK3g4VE9PVDFUMjY2OXZoQzJvZkZtaFhlNE9NVXZ3ZkFBRC8vOXEwUnozcUJ3QUEiLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6NDkzfSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvc2NyaXB0cy9mZXRjaC1ib290c3RyYXAtc2VjcmV0cy5zaCIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6Imd6aXAiLCJzb3VyY2UiOiJkYXRhOjtiYXNlNjQsSDRzSUFBQUFBQUFDLzd5VVFXOGFQeERGNy80VTgxL1FQOG5CMEZaVmM2Z2FLYUpFUW9xYUNpZzVwQkh5MnJQc2lGMTdhNDlMcWZqdzFXWjNhUW1WY3FJbjBIamU3ODBiVzl2N2I1aVNIYVlxNUNJZ2c4VG9vS0lLTTBXRkVEMjRRZFk1Qk5RZU9VQU1aRmRBTnJDeUdxSHlaRFZWcW9CejYwQjdOR2laVkJIQUlobzBGMkowT3hsL21pOG5Iei8wejUybVBhajVsV20wcGtCWUljTlhBU0NsaXB6ditjdmYvT2EwVlpHQnBMKzQvbkk3WDg3R28rbTQ1aS8zVGtuYi9DMmkzOEtaVWF3R3lZR2YxTTR5V2s0RzdaK3pWdUxWUnJySVZXVFlRYW9Ddm5zTDBseUlMa2JqOXEraU5JVlR4Sm1PWi9QSmFQbjVlamE3djV1ZS9tNmUrWjBpVWc4V3FpQ2pHUGM1TnVnUnN2cjlvaEdVd2NNRHlKK1E5UDk0S2J2ZFFhbmJlRmMrbXZ2eDhUMXdqbFlBQUtET0hTUTNpZ28wd0s2eDJydG4zcFZ3TjVyQVFzV0NFN2o2LzAyaitrRU1yMFZHOWN6M25oaHJiWW1sODF1WktyMnVZV1dWQmRnUVArR2lSNmpRbHhRQ09kdVNPVWNJckR5TFdLcXdobGVYbDZKY0cvSWdLeGo2YUlmdElPSnBUR2tQZzE4ZDlBekpaaFJJcTBMcWd0RFcxM2lzNjdiemtyWTVFQTNnTDB0OHB2Y1ltTFNzVkFnYjUwMm5tOVhobXE5TngxY3J0RHdZREJJUnRvR3gxRncwT3dBcHJaTnA0ZlQ2cUQyZy8wNGFqN0J6cnpDajlVczRidHM2eks4QUFBRC8vMk9XTUtFeEJRQUEiLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6NDkzfSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvc2NyaXB0cy9naXRvcHMtc3luYy5zaCIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6Imd6aXAiLCJzb3VyY2UiOiJkYXRhOjtiYXNlNjQsSDRzSUFBQUFBQUFDLzJUUFFZL2FNQkFGNFB2OGlzSE5vUnhjdDRkZVd1VkFROVFnc1FRRmRpK3JWUlRNbUZnYllzdDJrTkN5LzMwVkFnS0o4N3ozK2ZuYlNHeDBLemFWcjhGVFFFNmRRYXN0cVVvM0FFVzZ6TXZwcklpWk1EWUlSOVlJSXpXdnJQVU0vaFdUUlpMRmJGL3Bsa0dXbE9uaTVaTDBKQjBGTDJxcW1sRExtdVE3NzF6amYxQjdZQUJ5aXl5NjRneDJPcUNpSUdzMFR1OTBpeXdhYkFZd3o1UEpQSTYrOXhsSEIyNHI1d216ZERJZFE1RSs1ZXYwNGNnR1JWeVJNWUJXK0lvc09tTU1SL0g1K2I3TThPMHZocHBhUU93VjJ6VU5jcTRVTjIxemZOeWo5QVhqQ2xrMC9QbmU4S1p6a200blFCemlQZktSSmVYLzJUcGZyc3JuWXY2SGY5NDNFV1huR3VUS3I1RHY4ZGRQNU54UmNFZjhqZHlnMk5KQnRQMjZzMzFqR0o1T0dGeEhnS2gwUC9BckFBRC8vM2hjVy83VkFRQUEiLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6NDkzfSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvc2NyaXB0cy9mcmVzaHJzcy1jYWNoZS13YXJtLnNoIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiZ3ppcCIsInNvdXJjZSI6ImRhdGE6O2Jhc2U2NCxINHNJQUFBQUFBQUMvNFNSMzAvaVRoVEYzK2V2T000WHJacnZkQURqQzRxSldlb3VXZDBmWXVLRDY1S0J1YVdOWmFZN00xVWk4TDl2S0lMNHRQZXBhYzQ5NTU3UC9MY25SN21SSStVejVpbEFVR1ZSNWlXbEtpOFk2MTNlWFE1Ny9kc3VsN1lNVXF1Z1pPcklaODU3T2JZbXpTZXk4dVE4WjRPZjEvMjdaTmkvdWZ5Y2RMbTI0eWR5Y1c2bEtzcmNrUFIvaWp4UTV5UStiY1Z0enRpRXdqQWwwdjd3Q0hNR0FHbHVOSGhqRThraHBtcW1xUXdaMmhCR1RRbVJIc1Zyb3doN0VLVUtHYUpqT1pUSEVVVHBjaE9hYUY5SVRjL1NWRVdCQlg3VjFpOVpYaEQ2VjRNdUhDa040U0Ewb2doNmRBWnRhODFxU3F1bnlzQlZCa0s0S2NRemVHT3VSOHVPM0NaM25QMy9sWU0zZGd2enQ2RE52TXZCQjhsMTh1a09sU3R3ZGZ2OUJxdld1UCtTM0NiMXYrdisxd1RSL2xROVVWb1ZSYUJaV0NuMkkvNnh5Z0xCVlZTbmFHdUlMUm03U3BMZW9OczQzTExFQXQ2NkFGRmhnWW1qRXRIdkxJUXkycXdmc1ljSGlGZndScjNMOGZpSWd3UE1RZVBNZ24rejJOemd2TWZhTTdXVjBmd01OTXNEbW1kWU1yWlczeXMzemMwRWpjT1hNVVNCOC9QenJmSFJlam1PWTg1WWFoMkd5QTNtclRnK2FTNjN6Tjk0MDR6R0g0TEhLekRDcDFnZDM1R3lzR05WWk5ZSG1SdE5zN2pNU3V5d2FWOGN0RlkxUm83VVUyM3NDNklTTFZhVFlqUGxKaDdpeHlsRWY3NzhWK3EwMVc2Q3o1Y2N3bUkzNVAxN3QrbjJaZDZvOUt3aHp2NEdBQUQvLzRGT2g1TllBd0FBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQ5M30seyJncm91cCI6e30sInBhdGgiOiIvb3B0L2Vudi9mcmVzaHJzcy5lbnYiLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiIiLCJzb3VyY2UiOiJkYXRhOixGUkVTSFJTU19IT1NUJTNEcnNzLmRjdS5zaCUwQUZVTExURVhUUlNTX0hPU1QlM0RmdHIuZGN1LnNoJTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQyMH0seyJncm91cCI6e30sInBhdGgiOiIvb3B0L2Vudi9wbGFua2EuZW52IiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiIiwic291cmNlIjoiZGF0YTosUExBTktBX0hPU1QlM0RwbGFua2EuZGN1LnNoJTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQyMH0seyJncm91cCI6e30sInBhdGgiOiIvb3B0L2Vudi9uaXR0ZXIuZW52IiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiIiwic291cmNlIjoiZGF0YTosTklUVEVSX0hPU1QlM0RuaXR0ZXIuZGN1LnNoJTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQyMH0seyJncm91cCI6e30sInBhdGgiOiIvb3B0L2Vudi9yZWRsaWIuZW52IiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiIiwic291cmNlIjoiZGF0YTosUkVETElCX0hPU1QlM0RyZWRsaWIuZGN1LnNoJTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQyMH1dfSwic3lzdGVtZCI6eyJ1bml0cyI6W3siZW5hYmxlZCI6dHJ1ZSwibmFtZSI6InBvZG1hbi5zb2NrZXQifSx7ImNvbnRlbnRzIjoiW1VuaXRdXG5EZXNjcmlwdGlvbj1GaXJzdCBib290IGluaXRpYWxpemF0aW9uICh1cGRhdGVzICsgU1NIIHJlbW92YWwpXG5BZnRlcj1uZXR3b3JrLW9ubGluZS50YXJnZXRcbldhbnRzPW5ldHdvcmstb25saW5lLnRhcmdldFxuQ29uZGl0aW9uRmlyc3RCb290PXllc1xuXG5bU2VydmljZV1cblR5cGU9b25lc2hvdFxuRXhlY1N0YXJ0PS9vcHQvc2NyaXB0cy9maXJzdC1ib290LnNoXG5cbltJbnN0YWxsXVxuV2FudGVkQnk9bXVsdGktdXNlci50YXJnZXRcbiIsImVuYWJsZWQiOnRydWUsIm5hbWUiOiJmaXJzdC1ib290LnNlcnZpY2UifSx7ImNvbnRlbnRzIjoiW1VuaXRdXG5EZXNjcmlwdGlvbj1UYWlsc2NhbGUgRGFlbW9uXG5BZnRlcj1uZXR3b3JrLW9ubGluZS50YXJnZXQgZmlyc3QtYm9vdC5zZXJ2aWNlXG5XYW50cz1uZXR3b3JrLW9ubGluZS50YXJnZXRcblxuW1NlcnZpY2VdXG5TdGFuZGFyZE91dHB1dD1qb3VybmFsK2NvbnNvbGVcblN0YW5kYXJkRXJyb3I9am91cm5hbCtjb25zb2xlXG5FeGVjU3RhcnQ9L3Vzci9sb2NhbC9iaW4vdGFpbHNjYWxlZCAtLXN0YXRlPS92YXIvbGliL3RhaWxzY2FsZS90YWlsc2NhbGVkLnN0YXRlXG5SZXN0YXJ0PW9uLWZhaWx1cmVcblJlc3RhcnRTZWM9NVxuXG5bSW5zdGFsbF1cbldhbnRlZEJ5PW11bHRpLXVzZXIudGFyZ2V0XG4iLCJlbmFibGVkIjp0cnVlLCJuYW1lIjoidGFpbHNjYWxlZC5zZXJ2aWNlIn0seyJjb250ZW50cyI6IltVbml0XVxuRGVzY3JpcHRpb249QXV0aGVudGljYXRlIFRhaWxzY2FsZSAoaWYgbm90IGFscmVhZHkgYXV0aGVudGljYXRlZClcbkFmdGVyPW5ldHdvcmstb25saW5lLnRhcmdldCB0YWlsc2NhbGVkLnNlcnZpY2VcbldhbnRzPW5ldHdvcmstb25saW5lLnRhcmdldFxuUmVxdWlyZXM9dGFpbHNjYWxlZC5zZXJ2aWNlXG5cbltTZXJ2aWNlXVxuVHlwZT1vbmVzaG90XG5TdGFuZGFyZE91dHB1dD1qb3VybmFsK2NvbnNvbGVcblN0YW5kYXJkRXJyb3I9am91cm5hbCtjb25zb2xlXG5FeGVjU3RhcnQ9L2Jpbi9iYXNoIC1jICdcXFxuICBpZiAvdXNyL2xvY2FsL2Jpbi90YWlsc2NhbGUgc3RhdHVzIC0tanNvbiAyXHUwMDNlL2Rldi9udWxsIHwgZ3JlcCAtcSBcIlxcXCJCYWNrZW5kU3RhdGVcXFwiOlxcXCJSdW5uaW5nXFxcIlwiOyB0aGVuIFxcXG4gICAgZWNobyBcIlRhaWxzY2FsZSBhbHJlYWR5IGF1dGhlbnRpY2F0ZWRcIjsgXFxcbiAgZWxzZSBcXFxuICAgIGVjaG8gXCJBdXRoZW50aWNhdGluZyBUYWlsc2NhbGUuLi5cIjsgXFxcbiAgICAvdXNyL2xvY2FsL2Jpbi90YWlsc2NhbGUgdXAgLS1hdXRoLWtleT1cInRza2V5LWF1dGgta293YXZLRUV3SDExQ05UUkwtdHJaUlhzZkhqbTc2UlZiQUVHQVZpN1JmUndwVHNvcWlEXCIgLS1zc2ggLS1hY2NlcHQtcm91dGVzOyBcXFxuICBmaSdcblJlbWFpbkFmdGVyRXhpdD15ZXNcblxuW0luc3RhbGxdXG5XYW50ZWRCeT1tdWx0aS11c2VyLnRhcmdldFxuIiwiZW5hYmxlZCI6dHJ1ZSwibmFtZSI6InRhaWxzY2FsZS1hdXRoLnNlcnZpY2UifSx7ImNvbnRlbnRzIjoiW1VuaXRdXG5EZXNjcmlwdGlvbj1GZXRjaCBjb25maWd1cmF0aW9uIGZyb20gT0NJIGJ1Y2tldFxuQWZ0ZXI9bmV0d29yay1vbmxpbmUudGFyZ2V0IGZpcnN0LWJvb3Quc2VydmljZSB0YWlsc2NhbGUtYXV0aC5zZXJ2aWNlXG5XYW50cz1uZXR3b3JrLW9ubGluZS50YXJnZXRcblJlcXVpcmVzPWZpcnN0LWJvb3Quc2VydmljZVxuQmVmb3JlPWZldGNoLWJvb3RzdHJhcC1zZWNyZXRzLnNlcnZpY2VcbkNvbmRpdGlvblBhdGhFeGlzdHM9IS9ldGMvZmV0Y2gtY29uZmlnLWNvbXBsZXRlXG5cbltTZXJ2aWNlXVxuVHlwZT1vbmVzaG90XG5TdGFuZGFyZE91dHB1dD1qb3VybmFsK2NvbnNvbGVcblN0YW5kYXJkRXJyb3I9am91cm5hbCtjb25zb2xlXG5FbnZpcm9ubWVudEZpbGU9L2V0Yy9idWNrZXQvY29uZmlnXG5FeGVjU3RhcnQ9L29wdC9zY3JpcHRzL2ZldGNoLWNvbmZpZy5zaCAke0JVQ0tFVF9OQU1FfSAke09DSV9OQU1FU1BBQ0V9XG5FeGVjU3RhcnRQb3N0PS91c3IvYmluL3RvdWNoIC9ldGMvZmV0Y2gtY29uZmlnLWNvbXBsZXRlXG5SZW1haW5BZnRlckV4aXQ9eWVzXG5cbltJbnN0YWxsXVxuV2FudGVkQnk9bXVsdGktdXNlci50YXJnZXRcbiIsImVuYWJsZWQiOnRydWUsIm5hbWUiOiJmZXRjaC1jb25maWcuc2VydmljZSJ9LHsiY29udGVudHMiOiJbVW5pdF1cbkRlc2NyaXB0aW9uPUZldGNoIGJvb3RzdHJhcCBzZWNyZXRzIGZyb20gT0NJIFZhdWx0XG5BZnRlcj1uZXR3b3JrLW9ubGluZS50YXJnZXQgZmlyc3QtYm9vdC5zZXJ2aWNlIGZldGNoLWNvbmZpZy5zZXJ2aWNlXG5XYW50cz1uZXR3b3JrLW9ubGluZS50YXJnZXRcblJlcXVpcmVzPWZldGNoLWNvbmZpZy5zZXJ2aWNlXG5CZWZvcmU9aW5maXNpY2FsLWFnZW50LnNlcnZpY2VcblxuW1NlcnZpY2VdXG5UeXBlPW9uZXNob3RcblN0YW5kYXJkT3V0cHV0PWpvdXJuYWwrY29uc29sZVxuU3RhbmRhcmRFcnJvcj1qb3VybmFsK2NvbnNvbGVcbkVudmlyb25tZW50RmlsZT0vZXRjL29jaS12YXVsdC9jb25maWdcbkV4ZWNTdGFydD0vb3B0L3NjcmlwdHMvZmV0Y2gtYm9vdHN0cmFwLXNlY3JldHMuc2hcblJlbWFpbkFmdGVyRXhpdD15ZXNcblxuW0luc3RhbGxdXG5XYW50ZWRCeT1tdWx0aS11c2VyLnRhcmdldFxuIiwiZW5hYmxlZCI6dHJ1ZSwibmFtZSI6ImZldGNoLWJvb3RzdHJhcC1zZWNyZXRzLnNlcnZpY2UifV19fQ=="
        } -> (known after apply) # forces replacement
      ~ private_ip                          = "172.16.0.26" -> (known after apply)
      + public_ip                           = (known after apply)
      ~ region                              = "uk-london-1" -> (known after apply)
      ~ security_attributes                 = {} -> (known after apply)
      ~ security_attributes_state           = "STABLE" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.uk-london-1.aaaaaaaaocb6yhiygivj4tq5yfhsyyyefivkbtmd3vtiaws5mlhu5ni2bcvq" -> (known after apply)
      ~ system_tags                         = {} -> (known after apply)
      ~ time_created                        = "2026-02-12 18:55:59.331 +0000 UTC" -> (known after apply)
      + time_maintenance_reboot_due         = (known after apply)
        # (5 unchanged attributes hidden)

      ~ agent_config (known after apply)
      - agent_config {
          - are_all_plugins_disabled = false -> null
          - is_management_disabled   = false -> null
          - is_monitoring_disabled   = false -> null
        }

      ~ availability_config (known after apply)
      - availability_config {
          - is_live_migration_preferred = false -> null
          - recovery_action             = "RESTORE_INSTANCE" -> null
        }

      ~ create_vnic_details {
          ~ assign_ipv6ip             = false -> (known after apply)
          - assign_private_dns_record = false -> null
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "default/terraform"
              - "Oracle-Tags.CreatedOn" = "2026-02-12T18:55:58.769Z"
              - "terraform.managed"     = "terraform"
              - "terraform.name"        = "oci-apps"
              - "terraform.repo"        = "https://github.com/batinicaz/oci-apps"
            } -> (known after apply)
          ~ display_name              = "oci-apps" -> (known after apply)
          ~ freeform_tags             = {} -> (known after apply)
          + hostname_label            = (known after apply)
          ~ private_ip                = "172.16.0.26" -> (known after apply)
          ~ security_attributes       = {} -> (known after apply)
          ~ skip_source_dest_check    = false -> (known after apply)
          + subnet_cidr               = (known after apply)
          + vlan_id                   = (known after apply)
            # (3 unchanged attributes hidden)

          ~ ipv6address_ipv6subnet_cidr_pair_details (known after apply)
        }

      ~ launch_options {
          ~ boot_volume_type                    = "PARAVIRTUALIZED" -> (known after apply)
          ~ firmware                            = "UEFI_64" -> (known after apply)
          ~ is_consistent_volume_naming_enabled = true -> (known after apply)
          ~ remote_data_volume_type             = "PARAVIRTUALIZED" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ launch_volume_attachments (known after apply)

      ~ licensing_configs (known after apply)

      ~ placement_constraint_details (known after apply)

      ~ platform_config (known after apply)

      ~ preemptible_instance_config (known after apply)

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 2 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 1 -> (known after apply)
          ~ nvmes                         = 0 -> (known after apply)
          ~ processor_description         = "3.0 GHz Ampere® Altra™" -> (known after apply)
          + resource_management           = (known after apply)
          ~ vcpus                         = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ source_details {
          ~ boot_volume_vpus_per_gb         = "10" -> (known after apply)
          - is_preserve_boot_volume_enabled = false -> null
            # (4 unchanged attributes hidden)

          ~ instance_source_image_filter_details (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # oci_identity_dynamic_group.this will be updated in-place
  ~ resource "oci_identity_dynamic_group" "this" {
        id             = "ocid1.dynamicgroup.oc1..aaaaaaaaxep7ntfhuk7cuhcgnmyvgjag2fhhbxoefyveb4kdz2npzrsypusq"
      ~ matching_rule  = "instance.id = 'ocid1.instance.oc1.uk-london-1.anwgiljtwlhza7ach2vjzm336amtmuq5gyopjimti5gi5k45th3igidid3dq'" -> (known after apply)
        name           = "oci-apps"
        # (6 unchanged attributes hidden)
    }

  # oci_load_balancer_backend.traefik must be replaced
-/+ resource "oci_load_balancer_backend" "traefik" {
      ~ drain            = false -> (known after apply)
      ~ id               = "loadBalancers/ocid1.loadbalancer.oc1.uk-london-1.aaaaaaaakgjfvnm67avsld5nuuabjxago6nwzr6ssogd5b65zgxdcwvx7xxa/backendSets/traefik/backends/172.16.0.26:80" -> (known after apply)
      ~ ip_address       = "172.16.0.26" -> (known after apply) # forces replacement
      + max_connections  = (known after apply)
      ~ name             = "172.16.0.26:80" -> (known after apply)
      ~ offline          = false -> (known after apply)
      ~ state            = "SUCCEEDED" -> (known after apply)
      ~ weight           = 1 -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/quadlets/infisical-agent.container"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content                    = "376e5be45d95e0d9f99c6b0e795bb184" -> "cdb4a3fe75090f2c732dd02c5d93f045" # forces replacement
      ~ content_length             = "803" -> (known after apply)
      ~ content_md5                = "N25b5F2V4Nn5nGsOeVuxhA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fquadlets%2Finfisical-agent.container" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "6b5b5b51-9eab-4b92-afa5-53942828f099" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # tailscale_tailnet_key.this will be replaced due to changes in replace_triggered_by
-/+ resource "tailscale_tailnet_key" "this" {
      ~ created_at    = "2026-02-12T18:55:58Z" -> (known after apply)
      ~ expires_at    = "2026-02-12T19:05:58Z" -> (known after apply)
      ~ id            = "kowavKEEwH11CNTRL" -> (known after apply)
      ~ invalid       = true -> (known after apply)
      ~ key           = (sensitive value)
        tags          = [
            "tag:oci",
        ]
      + user_id       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 5 to destroy.

```